const battleAnalysisDatabaseHash: Record<string, Record<string, string[]>> = {
  '圣夜': {
    '圣夜': [
      '圣夜龙、跳龙卡。',
      '绿阵是关键，500是斩杀。',
      '后攻：可以全盖卡不发效果',
      '跳龙时，当前回合的玩家绿阵C1',
    ],
    '星兹': [
      '注意保命、炸后',
      '解大怪：霍普、500加攻',
    ],
    '化石': [
      '墓地不留怪，所以武神、啦啦队不一定好',
      '500加攻，霍普',
    ],
    '机皇': [
      '炸后',
      '留无限卡对面',
      '圣夜龙防守',
      '滚资源',
    ],
    '光天使': [
      '注意超量霍普的陷阱',
      '斩杀手段只有霍普、夏冬三角',
    ],
    '甘多拉': [
      '手里留1500+龙随便赢',
      '注意防双甘多拉',
    ],
    '盖亚': [
      '炸龙、炸场地',
      '站2300攻击力以上的怪对面是可以直接通召盖亚的',
      '手牌有个2600暗黑骑士的全时点',
    ],
    '口吃': [
      '炸妹妹、炸通召点',
    ],
    '三金': [
      '后场一定是那个永续陷阱',
      '能炸场地的时候炸场地',
    ],
    '破坏剑': [
      '读后场、炸后',
      '少超量防坑，斩杀可以跳龙',
      '霍普',
      '少跳龙防融合',
    ],
    '水产': [
      '炸怪，很容易赢',
    ],
    '圣骑士': [
      '最好是强脱',
    ],
    '流星龙': [
      '怪效炸调整防圣枪，断调整几乎必赢',
    ],
  }
}


export default battleAnalysisDatabaseHash;
