const excelArray: Record<string, any>[] = [
  {
    key: '除外',
    典型卡: '["DD乌鸦", "戴拿", "海空"]',
    小角龙: '2',
    黑魔导: '2',
    永火: '4',
    炎星: '2',
    核成: '1',
    忍者: '1',
    真红眼: '2',
    黑羽: '0',
    古代机械: '0',
  },
  {
    key: '除外限制',
    典型卡: '["海空"]',
    小角龙: '3',
    黑魔导: '2',
    永火: '0',
    炎星: '0',
    核成: '1',
    忍者: '2',
    真红眼: '0',
    黑羽: '0',
    古代机械: '0',
  },
  {
    key: '取对象抗性',
    典型卡: '["骑兵", "恶魔招来"]',
    小角龙: '1',
    黑魔导: '1',
    永火: '1',
    炎星: '0',
    核成: '1',
    忍者: '2',
    真红眼: '0',
    黑羽: '1',
    古代机械: '0',
  },
  {
    key: '效果破坏',
    典型卡: '["永火地狱恶魔", "雷破"]',
    小角龙: '1',
    黑魔导: '1',
    永火: '0',
    炎星: '0',
    核成: '1',
    忍者: '0',
    真红眼: '0',
    黑羽: '2',
    古代机械: '2',
  },
  {
    key: '二速解场',
    典型卡: '["生存境界", "次元魔法", "雷破", "加拿大虫"]',
    小角龙: '0',
    黑魔导: '0',
    永火: '2',
    炎星: '2',
    核成: '1',
    忍者: '0',
    真红眼: '0',
    黑羽: '2',
    古代机械: '3',
  },
  {
    key: '复数破坏',
    典型卡: '["永火地狱恶魔"]',
    小角龙: '1',
    黑魔导: '2',
    永火: '0',
    炎星: '3',
    核成: '1',
    忍者: '2',
    真红眼: '1',
    黑羽: '2',
    古代机械: '3',
  },
  {
    key: '召唤坑',
    典型卡: '["无底的落穴", "奈落的落穴"]',
    小角龙: '0',
    黑魔导: '0',
    永火: '2',
    炎星: '2',
    核成: '2',
    忍者: '2',
    真红眼: '2',
    黑羽: '3',
    古代机械: '1',
  },
  {
    key: '改变战斗状态',
    典型卡: '["球形栗子球", "鸟风", "狗风"]',
    小角龙: '2',
    黑魔导: '1',
    永火: '2',
    炎星: '0',
    核成: '3',
    忍者: '0',
    真红眼: '1',
    黑羽: '0',
    古代机械: '1',
  },
  {
    key: '攻宣坑',
    典型卡: '["水罩", "分断之壁"]',
    小角龙: '1',
    黑魔导: '0',
    永火: '0',
    炎星: '0',
    核成: '1',
    忍者: '0',
    真红眼: '3',
    黑羽: '3',
    古代机械: '0',
  },
  {
    key: '加减攻击力',
    典型卡: '["黑妹", "银幕的镜壁"]',
    小角龙: '0',
    黑魔导: '1',
    永火: '0',
    炎星: '2',
    核成: '1',
    忍者: '0',
    真红眼: '1',
    黑羽: '1',
    古代机械: '1',
  },
  {
    key: '无效怪兽效果',
    典型卡: '["禁忌的圣杯", "天罚"]',
    小角龙: '2',
    黑魔导: '0',
    永火: '2',
    炎星: '2',
    核成: '2',
    忍者: '2',
    真红眼: '1',
    黑羽: '1',
    古代机械: '1',
  },
  {
    key: '无效魔陷效果',
    典型卡: '["黑魔导阵", "炎舞-真斗"]',
    小角龙: '0',
    黑魔导: '2',
    永火: '2',
    炎星: '2',
    核成: '1',
    忍者: '3',
    真红眼: '1',
    黑羽: '2',
    古代机械: '0',
  },
  {
    key: '破坏魔陷',
    典型卡: '["旋风", "夜摄"]',
    小角龙: '0',
    黑魔导: '2',
    永火: '2',
    炎星: '2',
    核成: '0',
    忍者: '2',
    真红眼: '1',
    黑羽: '1',
    古代机械: '1',
  },
  {
    key: '盖怪',
    典型卡: '["加拿大虫", "无底的落穴"]',
    小角龙: '0',
    黑魔导: '0',
    永火: '2',
    炎星: '2',
    核成: '2',
    忍者: '1',
    真红眼: '2',
    黑羽: '3',
    古代机械: '1',
  },
  {
    key: '回到手牌',
    典型卡: '["冰枪龙"]',
    小角龙: '0',
    黑魔导: '2',
    永火: '2',
    炎星: '1',
    核成: '0',
    忍者: '0',
    真红眼: '2',
    黑羽: '0',
    古代机械: '1',
  },
  {
    key: '回到卡组',
    典型卡: '["水罩"]',
    小角龙: '2',
    黑魔导: '2',
    永火: '2',
    炎星: '2',
    核成: '2',
    忍者: '0',
    真红眼: '2',
    黑羽: '1',
    古代机械: '3',
  },
  {
    key: '爆发伤害',
    典型卡: '["黑妹", "黑羽 - 晓", "无限恐龙"]',
    小角龙: '2',
    黑魔导: '0',
    永火: '1',
    炎星: '0',
    核成: '0',
    忍者: '0',
    真红眼: '3',
    黑羽: '0',
    古代机械: '0',
  },
  {
    key: '削卡',
    典型卡: '["针虫"]',
    小角龙: '0',
    黑魔导: '1',
    永火: '0',
    炎星: '0',
    核成: '0',
    忍者: '0',
    真红眼: '0',
    黑羽: '1',
    古代机械: '0',
  },
  {
    key: '4000以上攻击力',
    典型卡: '["无限恐龙", "黑妹", "魔导师之力"]',
    小角龙: '0',
    黑魔导: '1',
    永火: '0',
    炎星: '0',
    核成: '0',
    忍者: '0',
    真红眼: '3',
    黑羽: '0',
    古代机械: '3',
  },
  {
    key: '攻宣三封',
    典型卡: '["古代机械巨龙", "幻层守护者"]',
    小角龙: '0',
    黑魔导: '1',
    永火: '3',
    炎星: '0',
    核成: '0',
    忍者: '0',
    真红眼: '0',
    黑羽: '0',
    古代机械: '0',
  },
];

// 效果对卡组的克制，这是一个Object
export const effectRestrainDeck = excelArray
  // 转换字符串数字变成数字
  .map((item) => {
    Object.keys(item).forEach((_item) => {
      const parseNumber = parseInt(item[_item], 10);
      if (!Number.isNaN(parseNumber)) item[_item] = parseNumber;
    });
    return item;
  })
  // 把数组变成object，用key当做key
  .reduce((obj, item) => {
    obj[item.key] = {
      ...item,
      key: undefined,
      典型卡: JSON.parse(item['典型卡']),
    };
    delete obj[item.key].key;
    return obj;
  }, {});

// 当前对手害怕的效果
export const currentDeckRestrain = (currentDeckName: string) => {
  const RestrainObject: Record<string, number> = excelArray.reduce(
    (obj, item) => {
      if (item[currentDeckName] && item[currentDeckName] >= 1) {
        obj[item.key] = parseInt(item[currentDeckName], 10);
      }
      return obj;
    },
    {}
  );
  return (
    Object.keys(RestrainObject)
      .map((item) => {
        return [item, RestrainObject[item]];
      })
      // @ts-ignore
      .sort((a, b) => a[1] - b[1])
  );
};
